<a href="https://colab.research.google.com/github/nurimammasri/Wooky-Pandas/blob/master/03.%20Indexing%20and%20Akses%20Selection%20Data%20Frame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Indexing/Akses Selection**

**Indexing DataFrame**
Akses DataFrame sering juga di kenal indexing atau Subset Selection. secara sederhana maknanya adalah kita memilih suatu data dari baris tertentu dan column tertentu. kita bisa saja memilih beberapa baris dan semua kolom dari data, semua baris dan beberapa column dari data, atau beberapa baris dan bebearpa column dari data.

Ada banyak cara-cara kita indexing suatu dataframe. diantranya adalah dengan menggunakan :

*   `dataframe[]` : cara seperti ini dikenal sebagai index operator.
*   `dataframe.loc[]`: operator yang menggunakan label untuk mengakses data, jika misalkan kamu melakukan dataframe.loc[‘jumlah’], berarti kamu hendak mengakses data yang mempunyai index jumlah
*   `dataframe.iloc[]`: operator yang menggunakan posisi index untuk mengakses data. jikalau kamu melakukan dataframe.iloc[2] berarti kamu hendak mengakses dataframe dengan index posisi 2

---

*name of colum*
```
df['column']
```
---
*label*
```
df.loc[index, column]
```
---

*numeric*
```
df.iloc[ : , : ]

df.iloc[index,column]

df.iloc[[ , , ],[ , , ]]
```
---

## **Row and Columns Selection**

### df['column'] and df[index:index]

You can select a column (**df[col]**) and return column with label col as Series 

Or a few columns (**df[[col1, col2]]**) and returns columns as a new DataFrame.

In [ ]:
import pandas as pd

df = pd.DataFrame({'Calon President': ['Imam', 'Abrar', 'Muthia', 'Itha'],
                   'Umur' : [12,34,5,67],
                   'Alamat' : ['Jln.1', 'Jln.2', 'Jln.3', 'Jln.4'],
                   'Jumlah Voting': [100, 50, 60, 20],
                   'Jenis Kelamin':['L', 'L', 'P', 'P'],
                   'Negara':['Indonesia', 'Australia', 'Amerika', 'Mesir']})
df

  Calon President  Umur Alamat  Jumlah Voting Jenis Kelamin     Negara
0            Imam    12  Jln.1            100             L  Indonesia
1           Abrar    34  Jln.2             50             L  Australia
2          Muthia     5  Jln.3             60             P    Amerika
3            Itha    67  Jln.4             20             P      Mesir

In [ ]:
# selecting index
df[0:2]

  Calon President  Umur Alamat  Jumlah Voting Jenis Kelamin     Negara
0            Imam    12  Jln.1            100             L  Indonesia
1           Abrar    34  Jln.2             50             L  Australia

In [ ]:
# selecting column
df['Umur'] #type() -> Series
df[['Umur']] # type() -> DataFrame

   Umur
0    12
1    34
2     5
3    67

In [ ]:
# multiple selecting column with list
df[['Calon President', 'Jumlah Voting', 'Jenis Kelamin']]

  Calon President  Jumlah Voting Jenis Kelamin
0            Imam            100             L
1           Abrar             50             L
2          Muthia             60             P
3            Itha             20             P

In [ ]:
# menyimpan hasil pemilihan ke dalam variable
df2 = df[['Calon President', 'Jumlah Voting']]
df2

  Calon President  Jumlah Voting
0            Imam            100
1           Abrar             50
2          Muthia             60
3            Itha             20

In [ ]:
df[df.columns[1:3]]

   Umur Alamat
0    12  Jln.1
1    34  Jln.2
2     5  Jln.3
3    67  Jln.4

In [ ]:
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df['one'])
df

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [ ]:
df['two']['b']

2

In [ ]:
type(df.loc['b'])

pandas.core.series.Series

In [ ]:
df.loc['b']

one    2.0
two    2.0
Name: b, dtype: float64

In [ ]:
df.loc['b'].two

2.0

In [ ]:
type(df.iloc[3])

pandas.core.series.Series

In [ ]:
df.iloc[3]

one    NaN
two    4.0
Name: d, dtype: float64

In [ ]:
df.iloc[3].iloc[1]

4.0

In [ ]:
df.iloc[3, 1]

4

In [ ]:
df.loc['d'].loc['two']

4.0

In [ ]:
import pandas as pd

df = pd.DataFrame({'Siswa': ['Imam', 'Abrar', 'Muthia', 'Itha'],
                   'Umur' : [12,34,5,67],
                   'Alamat' : ['Jln.1', 'Jln.2', 'Jln.3', 'Jln.4'],
                   'Jenis Kelamin':['L', 'L', 'P', 'P']})
df

    Siswa  Umur Alamat Jenis Kelamin
0    Imam    12  Jln.1             L
1   Abrar    34  Jln.2             L
2  Muthia     5  Jln.3             P
3    Itha    67  Jln.4             P

In [ ]:
df[df['Umur'] >= 12]

   Siswa  Umur Alamat Jenis Kelamin
0   Imam    12  Jln.1             L
1  Abrar    34  Jln.2             L
3   Itha    67  Jln.4             P

In [ ]:
df[(df['Umur'] >= 12) & (df['Jenis Kelamin'] == 'L')]

   Siswa  Umur Alamat Jenis Kelamin
0   Imam    12  Jln.1             L
1  Abrar    34  Jln.2             L

### df.column

In [ ]:
import pandas as pd

df = pd.DataFrame({'Calon President': ['Imam', 'Abrar', 'Muthia', 'Itha'],
                   'Umur' : [12,34,5,67],
                   'Alamat' : ['Jln.1', 'Jln.2', 'Jln.3', 'Jln.4'],
                   'Jumlah Voting': [100, 50, 60, 20],
                   'Jenis Kelamin':['L', 'L', 'P', 'P'],
                   'Negara':['Indonesia', 'Australia', 'Amerika', 'Mesir']})
df

  Calon President  Umur Alamat  Jumlah Voting Jenis Kelamin     Negara
0            Imam    12  Jln.1            100             L  Indonesia
1           Abrar    34  Jln.2             50             L  Australia
2          Muthia     5  Jln.3             60             P    Amerika
3            Itha    67  Jln.4             20             P      Mesir

In [ ]:
df.Umur # series

0    12
1    34
2     5
3    67
Name: Umur, dtype: int64

In [ ]:
df.Umur[2]

5

In [ ]:
df.Umur[0:2]

0    12
1    34
Name: Umur, dtype: int64

In [ ]:
df[df.columns[1:3]]

   Umur Alamat
0    12  Jln.1
1    34  Jln.2
2     5  Jln.3
3    67  Jln.4

### df.loc[ : , : ] and df.loc[ [index/filtering] , [ col] ] (label)

***label*** indexing and slicing

**select row**

> df.loc[idx_row]

> df.loc[idx_row_start:idx_row_end]

> df.loc[[row1,row2,row3,row n]]

**select columns**

> df.loc[ : , col]

> df.loc[ : , col_start:col_end]

> df.loc[ : , [col1, col2, col3, col n]]

slicing (select cols and rows)

> df.loc[idx_row_start:idx_row_end, col_start:col_end]

select with indexing

> df.loc[[row1,row2,row3,row n], [col1, col2, col3, col n]]

filtering

> df.loc[df['column_name'] == some_value]

> df.loc[df['column_name'] == some_value]

iterable

> df.loc[df['column_name'].isin(some_values)]

combine with Operator Logical

> df.loc[(df['column_name'] >= A) & (df['column_name'] <= B)]

......................................................................................

[DataFrame.loc](https://pandas.pydata.org/pandas-docs/version/0.23.1/generated/pandas.DataFrame.loc.html)

Access a group of rows and columns by label(s) or a boolean array.

.loc[] is primarily label based, but may also be used with a boolean array.

Allowed inputs are:

* A single label, e.g. 5 or 'a', (note that 5 is interpreted as a label of the index, and never as an integer position along the index).

* A list or array of labels, e.g. ['a', 'b', 'c'].

* A slice object with labels, e.g. 'a':'f'.

`Warning Note that contrary to usual python slices, both the start and the stop are included`

* A boolean array of the same length as the axis being sliced, e.g. [True, False, True].

A callable function with one argument (the calling Series, DataFrame or Panel) and that returns valid output for indexing (one of the above)

In [ ]:
import pandas as pd

df = pd.DataFrame({'Calon President': ['Imam', 'Abrar', 'Muthia', 'Itha'],
                   'Umur' : [12,34,5,67],
                   'Alamat' : ['Jln.1', 'Jln.2', 'Jln.3', 'Jln.4'],
                   'Jumlah Voting': [100, 50, 60, 20],
                   'Jenis Kelamin':['L', 'L', 'P', 'P'],
                   'Negara':['Indonesia', 'Australia', 'Amerika', 'Mesir']})
df

  Calon President  Umur Alamat  Jumlah Voting Jenis Kelamin     Negara
0            Imam    12  Jln.1            100             L  Indonesia
1           Abrar    34  Jln.2             50             L  Australia
2          Muthia     5  Jln.3             60             P    Amerika
3            Itha    67  Jln.4             20             P      Mesir

In [ ]:
df.loc[[2]]

  Calon President  Umur Alamat  Jumlah Voting Jenis Kelamin   Negara
2          Muthia     5  Jln.3             60             P  Amerika

In [ ]:
df.loc[:,['Negara']]

      Negara
0  Indonesia
1  Australia
2    Amerika
3      Mesir

In [ ]:
df.loc[0:2, 'Calon President':'Jumlah Voting']

  Calon President  Umur Alamat  Jumlah Voting
0            Imam    12  Jln.1            100
1           Abrar    34  Jln.2             50
2          Muthia     5  Jln.3             60

In [ ]:
df.loc[[0,2], ['Calon President', 'Jumlah Voting']]

  Calon President  Jumlah Voting
0            Imam            100
2          Muthia             60

In [ ]:
df.loc[df['Jenis Kelamin'] == 'L']

  Calon President  Umur Alamat  Jumlah Voting Jenis Kelamin     Negara
0            Imam    12  Jln.1            100             L  Indonesia
1           Abrar    34  Jln.2             50             L  Australia

In [ ]:
df.loc[(df['Umur'] >= 12) & (df['Jenis Kelamin'] == 'L')]

  Calon President  Umur Alamat  Jumlah Voting Jenis Kelamin     Negara
0            Imam    12  Jln.1            100             L  Indonesia
1           Abrar    34  Jln.2             50             L  Australia

In [ ]:
lakilaki = df['Jenis Kelamin'] == 'L'
umur = df['Umur'] >= 12
df.loc[lakilaki & umur]

  Calon President  Umur Alamat  Jumlah Voting Jenis Kelamin     Negara
0            Imam    12  Jln.1            100             L  Indonesia
1           Abrar    34  Jln.2             50             L  Australia

In [ ]:
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']),
   'tree' : pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e']),
   'four' : pd.Series([1, 2, 3, 4, 5, 6], index=['a', 'b', 'c', 'd', 'e', 'f'])}

data_frame = pd.DataFrame(d)
data_frame

   one  two  tree  four
a  1.0  1.0   1.0     1
b  2.0  2.0   2.0     2
c  3.0  3.0   3.0     3
d  NaN  4.0   4.0     4
e  NaN  NaN   5.0     5
f  NaN  NaN   NaN     6

In [ ]:
data_frame.loc[['b']]

   one  two  tree  four
b  2.0  2.0   2.0     2

In [ ]:
data_frame.loc['b':'d']

   one  two  tree  four
b  2.0  2.0   2.0     2
c  3.0  3.0   3.0     3
d  NaN  4.0   4.0     4

In [ ]:
data_frame.loc['b':'d', 'two':'four']

   two  tree  four
b  2.0   2.0     2
c  3.0   3.0     3
d  4.0   4.0     4

In [ ]:
list_pick = ['two', 'one', 'four', 'five']
data_frame.loc[:, data_frame.columns.isin(list_pick)]

   one  two  four
a  1.0  1.0     1
b  2.0  2.0     2
c  3.0  3.0     3
d  NaN  4.0     4
e  NaN  NaN     5
f  NaN  NaN     6

In [ ]:
import pandas as pd
import numpy as np
np.random.seed(5)
df = pd.DataFrame(np.random.randint(100, size=(100, 6)), 
                  columns=list('ABCDEF'), 
                  index=['R{}'.format(i) for i in range(100)])
df.head()

     A   B   C   D   E   F
R0  99  78  61  16  73   8
R1  62  27  30  80   7  76
R2  15  53  80  27  44  77
R3  75  65  47  30  84  86
R4  18   9  41  62   1  82

In [ ]:
df.loc[:, 'C':'E']

      C   D   E
R0   61  16  73
R1   30  80   7
R2   80  27  44
R3   47  30  84
R4   41  62   1
..   ..  ..  ..
R95  76  66  56
R96  86  74  37
R97  59  25  39
R98  68  81  69
R99  86   1  74

[100 rows x 3 columns]

In [ ]:
df.loc['R6':'R10', 'C':'E']

      C   D   E
R6   51  27  31
R7   83  19  18
R8   11  67  65
R9   78  27  29
R10   7  16  94

In [ ]:
df.loc[:, df.columns.isin(list('BCD'))]

      B   C   D
R0   78  61  16
R1   27  30  80
R2   53  80  27
R3   65  47  30
R4    9  41  62
..   ..  ..  ..
R95   7  76  66
R96  31  86  74
R97  12  59  25
R98   7  68  81
R99  20  86   1

[100 rows x 3 columns]

In [ ]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'A': 'foo bar foo bar foo bar foo foo'.split(),
                   'B': 'one one two three two two one three'.split(),
                   'C': np.arange(8), 'D': np.arange(8) * 2})
df

     A      B  C   D
0  foo    one  0   0
1  bar    one  1   2
2  foo    two  2   4
3  bar  three  3   6
4  foo    two  4   8
5  bar    two  5  10
6  foo    one  6  12
7  foo  three  7  14

In [ ]:
df.loc[df['A'] == 'foo']

     A      B  C   D
0  foo    one  0   0
2  foo    two  2   4
4  foo    two  4   8
6  foo    one  6  12
7  foo  three  7  14

In [ ]:
df.loc[df['B'].isin(['one','three'])]

     A      B  C   D
0  foo    one  0   0
1  bar    one  1   2
3  bar  three  3   6
6  foo    one  6  12
7  foo  three  7  14

### df.iloc[ : , : ] and df.iloc[ [index/filtering] , [col] ] (integer)

***numeric*** indexing and slicing

*slicing*

> df.iloc[idx_row_start:idx_row_end, col_start:col_end]

indexing

> df.iloc[[row1,row2,row3,row n], [col1, col2, col3, col n]]

In [ ]:
import pandas as pd

df = pd.DataFrame({'Calon President': ['Imam', 'Abrar', 'Muthia', 'Itha'],
                   'Umur' : [12,34,5,67],
                   'Alamat' : ['Jln.1', 'Jln.2', 'Jln.3', 'Jln.4'],
                   'Jumlah Voting': [100, 50, 60, 20],
                   'Jenis Kelamin':['L', 'L', 'P', 'P'],
                   'Negara':['Indonesia', 'Australia', 'Amerika', 'Mesir']})
df

  Calon President  Umur Alamat  Jumlah Voting Jenis Kelamin     Negara
0            Imam    12  Jln.1            100             L  Indonesia
1           Abrar    34  Jln.2             50             L  Australia
2          Muthia     5  Jln.3             60             P    Amerika
3            Itha    67  Jln.4             20             P      Mesir

In [ ]:
df.iloc[[3]]

  Calon President  Umur Alamat  Jumlah Voting Jenis Kelamin Negara
3            Itha    67  Jln.4             20             P  Mesir

In [ ]:
df.iloc[2:4]

  Calon President  Umur Alamat  Jumlah Voting Jenis Kelamin   Negara
2          Muthia     5  Jln.3             60             P  Amerika
3            Itha    67  Jln.4             20             P    Mesir

In [ ]:
df.iloc[:, [1]]

   Umur
0    12
1    34
2     5
3    67

In [ ]:
df.iloc[0:2, :]

  Calon President  Umur Alamat  Jumlah Voting Jenis Kelamin     Negara
0            Imam    12  Jln.1            100             L  Indonesia
1           Abrar    34  Jln.2             50             L  Australia

In [ ]:
df.iloc[0:2,0:2]

  Calon President  Umur
0            Imam    12
1           Abrar    34

In [ ]:
df.iloc[[3],:]

  Calon President  Umur Alamat  Jumlah Voting Jenis Kelamin Negara
3            Itha    67  Jln.4             20             P  Mesir

In [ ]:
# df.iloc[0:2,['Umur', 'Alamat']] .iloc requires numeric indexers, got ['Umur' 'Alamat']
df.iloc[[0,2,3], [1,2]]

   Umur Alamat
0    12  Jln.1
2     5  Jln.3
3    67  Jln.4

In [ ]:
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df.iloc[2])

one    3.0
two    3.0
Name: c, dtype: float64

## Task

cobalah suatu metode dari pandas untuk mengetahui beberapa data pertama dan beberapa data terakhir. kemudian sebutkan nilai dari:
- baris pertama dari column price
- baris terakhir dari column color

In [ ]:
# from google.colab import drive
# drive.mount('/content/drive/')

In [ ]:
# '/content/drive/My Drive/Colab Notebooks/Wooky Pandas/diamonds-1.csv'
# Membaca data dan memasukannya kedalam suatu variabel

# url = 'https://blog.sanbercode.com/wp-content/uploads/2020/04/diamonds-1.csv'
# df_from_csv = pd.read_csv("diamonds-1.csv")

# import pandas as pd
# df_from_csv = pd.read_csv('https://drive.google.com/uc?id=13jtHSMJIa8gzYncyus2o2uTm-H_LFN0B')
# df_from_csv

       Unnamed: 0  carat        cut color  ... price     x     y     z
0               1   0.23      Ideal     E  ...   326  3.95  3.98  2.43
1               2   0.21    Premium     E  ...   326  3.89  3.84  2.31
2               3   0.23       Good     E  ...   327  4.05  4.07  2.31
3               4   0.29    Premium     I  ...   334  4.20  4.23  2.63
4               5   0.31       Good     J  ...   335  4.34  4.35  2.75
...           ...    ...        ...   ...  ...   ...   ...   ...   ...
53935       53936   0.72      Ideal     D  ...  2757  5.75  5.76  3.50
53936       53937   0.72       Good     D  ...  2757  5.69  5.75  3.61
53937       53938   0.70  Very Good     D  ...  2757  5.66  5.68  3.56
53938       53939   0.86    Premium     H  ...  2757  6.15  6.12  3.74
53939       53940   0.75      Ideal     D  ...  2757  5.83  5.87  3.64

[53940 rows x 11 columns]

In [1]:
# diamonds-1.csv
import pandas as pd
df_from_csv = pd.read_csv('https://raw.githubusercontent.com/nurimammasri/Wooky-Pandas/master/Data/diamonds-1.csv')
df_from_csv

       Unnamed: 0  carat        cut color  ... price     x     y     z
0               1   0.23      Ideal     E  ...   326  3.95  3.98  2.43
1               2   0.21    Premium     E  ...   326  3.89  3.84  2.31
2               3   0.23       Good     E  ...   327  4.05  4.07  2.31
3               4   0.29    Premium     I  ...   334  4.20  4.23  2.63
4               5   0.31       Good     J  ...   335  4.34  4.35  2.75
...           ...    ...        ...   ...  ...   ...   ...   ...   ...
53935       53936   0.72      Ideal     D  ...  2757  5.75  5.76  3.50
53936       53937   0.72       Good     D  ...  2757  5.69  5.75  3.61
53937       53938   0.70  Very Good     D  ...  2757  5.66  5.68  3.56
53938       53939   0.86    Premium     H  ...  2757  6.15  6.12  3.74
53939       53940   0.75      Ideal     D  ...  2757  5.83  5.87  3.64

[53940 rows x 11 columns]

In [2]:
# code here
# Dengan index
df_from_csv['price'][[0]]
# Dengan method loc
df_from_csv.loc[0, ['price']]
# Dengan method iloc
df_from_csv['price'].iloc[[0]]
# Dengan method head
df_from_csv['price'].head(1)

0    326
Name: price, dtype: int64

In [3]:
# Dengan index
df_from_csv['color'][[len(df_from_csv)-1]]
# Dengan method tail()
df_from_csv['color'].tail(1)

53939    D
Name: color, dtype: object

## Row Selection

### Selection by Label

In [4]:
# using loc[]
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

data_frame = pd.DataFrame(d)
print(data_frame.loc['b'])

one    2.0
two    2.0
Name: b, dtype: float64

### Selection by integer location

In [5]:
# using iloc[]
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df.iloc[2])

one    3.0
two    3.0
Name: c, dtype: float64

### Slice Rows
Multiple rows can be selected using ‘ : ’ operator.

In [6]:
# using [ : ] bukan [index]
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df[2:4])

   one  two
c  3.0    3
d  NaN    4

# **Hierarchical indexing (MultiIndex)**

There are various ways to create multiple indices. One of the simplest ways to create a multi index *Series* or *DataFrame* object is by passing a list of two or more arrays to the constructor:

In [7]:
import numpy as np
df = pd.DataFrame(np.random.rand(4,2),
                  index = [['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=['data1', 'data2'])
df

        data1     data2
a 1  0.402135  0.769638
  2  0.684482  0.155040
b 1  0.110074  0.666284
  2  0.457973  0.305997

Other options include passing a dictionary where the keys are spelled out as tuples:

In [8]:
data = {
    ('California', 2000):33871648,
    ('California', 2010):37253956,
    ('Texas', 2000):20851820,
    ('Texas', 2010):25142261,
    ('New York', 2000):1697657,
    ('New York', 2010):1232345
}

pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25142261
New York    2000     1697657
            2010     1232345
dtype: int64

Finally, you can explicitly create a multi index by using the class method constructors available in the `pd.MultiIndex`:

The `MultiIndex` object is the hierarchical analogue of the standard `Index` object which typically stores the axis labels in pandas objects. You can think of MultiIndex as an array of tuples where each tuple is unique. A *MultiIndex* can be created from a list of arrays (using `MultiIndex.from_arrays()`), an array of tuples (using `MultiIndex.from_tuples()`), a crossed set of iterables (using `MultiIndex.from_product()`), or a DataFrame (using `MultiIndex.from_frame()`). The *Index* constructor will attempt to return a *MultiIndex* when it is passed a list of tuples. The following examples demonstrate different ways to initialize MultiIndexes.

In [9]:
index = pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])
index

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [10]:
df = pd.DataFrame(np.random.randn(4, 2), index=index)
df

            0         1
a 1 -0.539993 -0.796116
  2  0.989319 -0.192968
b 1 -0.144493  0.513613
  2  0.353693  1.184559

In [11]:
arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
          ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]
tuples = list(zip(*arrays))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [12]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [13]:
s = pd.Series(np.random.randn(8), index=index)
s

first  second
bar    one      -0.639115
       two       0.283018
baz    one      -1.519789
       two       0.393616
foo    one       0.060709
       two      -0.181996
qux    one      -0.195794
       two       1.265718
dtype: float64

When you want every pairing of the elements in two iterables, it can be easier to use the `MultiIndex.from_product()` method:

In [14]:
iterables = [['bar', 'baz', 'foo', 'qux'], ['one', 'two']]

index = pd.MultiIndex.from_product(iterables, names=['first', 'second'])
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [15]:
df = pd.DataFrame(np.random.randn(8, 2), index=index)
df

                     0         1
first second
bar   one     0.292375 -1.678403
      two    -1.033846 -0.553606
baz   one     0.533820  0.776791
      two    -1.550881  0.015424
foo   one     0.633699 -0.265827
      two    -0.889071 -0.312364
qux   one    -0.046777  0.612852
      two    -1.060856  0.060644

You can also construct a *MultiIndex* from a *DataFrame* directly, using the method `MultiIndex.from_frame()`. This is a complementary method to `MultiIndex.to_frame()`.

In [16]:
df = pd.DataFrame([['bar', 'one'], ['bar', 'two'],
                    ['foo', 'one'], ['foo', 'two']],
                   columns=['first', 'second'])
index = pd.MultiIndex.from_frame(df)
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('foo', 'one'),
            ('foo', 'two')],
           names=['first', 'second'])

In [17]:
df = pd.DataFrame(np.random.randn(4, 4), index=index)
df

                     0         1         2         3
first second
bar   one     0.647387  0.000179 -0.685564  3.544519
      two     0.778384 -2.191344 -0.263414  0.411047
foo   one    -0.449428  0.089208  1.709236 -1.054647
      two     0.885504  2.052394 -0.027762  0.508245

As a convenience, you can pass a list of arrays directly into Series or DataFrame to construct a MultiIndex automatically:

In [18]:
arrays = [np.array(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux']),
           np.array(['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two'])]
 

s = pd.Series(np.random.randn(8), index=arrays)
s

bar  one    1.093461
     two   -0.951932
baz  one   -2.225610
     two    0.056689
foo  one    0.605289
     two   -0.666322
qux  one   -2.046728
     two    0.008180
dtype: float64

In [19]:
df = pd.DataFrame(np.random.randn(8, 4), index=arrays)
df

                0         1         2         3
bar one -0.006140 -0.973525 -1.553274  0.063404
    two -0.417082  0.062219  1.387019 -0.618363
baz one  0.479408  0.275253  0.476729 -1.132973
    two  1.284865  0.369955 -1.175767 -0.631867
foo one -1.307521 -2.433966  0.152099  1.402861
    two  1.698164  1.828743 -0.044763 -0.576465
qux one  0.304747  0.696760 -0.302811  1.493813
    two -1.842204 -0.875389 -0.416975 -0.953548

In [20]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [21]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(3, 8), index=['A', 'B', 'C'], columns=index)

df

first        bar                 baz  ...       foo       qux
second       one       two       one  ...       two       one       two
A       1.662161 -0.926316 -0.094421  ... -0.854901  0.529797 -1.287988
B      -0.432565 -1.019030  0.028014  ...  2.147137 -0.334100  0.197147
C      -0.249176  0.104195 -0.333314  ... -1.221091  2.751807  1.208724

[3 rows x 8 columns]

In [22]:
pd.DataFrame(np.random.randn(6, 6), index=index[:6], columns=index[:6])

first              bar                 baz                 foo
second             one       two       one       two       one       two
first second
bar   one    -0.627570  0.000128 -1.448372  2.827538 -0.999278 -1.092456
      two     1.893961 -0.819289  0.186883  0.876870  0.376570  2.215069
baz   one    -0.772546  0.808812 -1.604034 -1.250553 -1.208487 -1.212003
      two     0.245088 -0.391731  1.921329 -1.132153 -0.312953  1.139057
foo   one    -0.320765 -0.636973  2.499728  0.902578 -0.055609  0.846799
      two    -0.317828 -0.142525  0.670275  0.022885 -0.782024 -0.070295

Reconstructing the level labels 

Defined levels

In [23]:
index.get_level_values(0)

Index(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'], dtype='object', name='first')

In [24]:
index.get_level_values(0)

Index(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'], dtype='object', name='first')

In [25]:
df.columns.levels  # original MultiIndex

FrozenList([['bar', 'baz', 'foo', 'qux'], ['one', 'two']])

In [26]:

df[['foo','qux']].columns.levels  # sliced

FrozenList([['bar', 'baz', 'foo', 'qux'], ['one', 'two']])

Basic indexing on axis with MultiIndex

In [27]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(3, 8), index=['A', 'B', 'C'], columns=index)

df

first        bar                 baz  ...       foo       qux
second       one       two       one  ...       two       one       two
A      -1.548855 -0.421488 -0.141978  ...  1.239240 -0.770613 -0.154056
B      -0.444018 -0.452989 -0.700530  ... -0.246587 -0.500756 -0.150897
C       0.422429  0.615003 -0.151257  ...  2.426643 -1.427324  0.249035

[3 rows x 8 columns]

In [28]:
df['bar']

second       one       two
A      -1.548855 -0.421488
B      -0.444018 -0.452989
C       0.422429  0.615003

In [29]:
df['bar', 'one']

A   -1.548855
B   -0.444018
C    0.422429
Name: (bar, one), dtype: float64

In [30]:
df['bar']['one']

A   -1.548855
B   -0.444018
C    0.422429
Name: one, dtype: float64

In [31]:
# Transfor DataFrame
df = df.T 
df

                     A         B         C
first second
bar   one    -1.548855 -0.444018  0.422429
      two    -0.421488 -0.452989  0.615003
baz   one    -0.141978 -0.700530 -0.151257
      two    -0.169572 -0.054556  0.522434
foo   one    -0.689118 -0.050591  0.221417
      two     1.239240 -0.246587  2.426643
qux   one    -0.770613 -0.500756 -1.427324
      two    -0.154056 -0.150897  0.249035

In [32]:
df.loc['bar', 'two']

A   -0.421488
B   -0.452989
C    0.615003
Name: (bar, two), dtype: float64

In [33]:
df.loc[('bar', 'two')]

A   -0.421488
B   -0.452989
C    0.615003
Name: (bar, two), dtype: float64

In [34]:
df.loc[('bar', 'two'), 'A']

-0.42148825287554376

In [35]:
df.loc['baz':'foo']

                     A         B         C
first second
baz   one    -0.141978 -0.700530 -0.151257
      two    -0.169572 -0.054556  0.522434
foo   one    -0.689118 -0.050591  0.221417
      two     1.239240 -0.246587  2.426643

In [36]:
df.loc[('baz', 'two'):('qux', 'one')]

                     A         B         C
first second
baz   two    -0.169572 -0.054556  0.522434
foo   one    -0.689118 -0.050591  0.221417
      two     1.239240 -0.246587  2.426643
qux   one    -0.770613 -0.500756 -1.427324

In [37]:
df.loc[('baz', 'two'):'foo']

                     A         B         C
first second
baz   two    -0.169572 -0.054556  0.522434
foo   one    -0.689118 -0.050591  0.221417
      two     1.239240 -0.246587  2.426643

In [38]:
df.loc[[('bar', 'two'), ('qux', 'one')]]

                     A         B         C
first second
bar   two    -0.421488 -0.452989  0.615003
qux   one    -0.770613 -0.500756 -1.427324

In [39]:
arrays = [np.array(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux']),
           np.array(['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two'])]
 

s = pd.Series(np.random.randn(8), index=arrays)
s

bar  one   -0.712047
     two   -0.266859
baz  one    1.168848
     two   -2.489449
foo  one    0.972739
     two   -1.542257
qux  one    1.562117
     two    0.575460
dtype: float64

In [40]:
s['qux']

one    1.562117
two    0.575460
dtype: float64